docs: use mermaid architecture diagram
